//JSORT05      JOB (),' ',CLASS=A,MSGCLASS=Q,MSGLEVEL=(1,1),
//        REGION=0M,NOTIFY=&SYSUID
//***********************************************************
//*DIVIDIR UN FICHERO EN VARIOS FICHEROS
//**********************************************************
//STEP1   EXEC PGM=SORT,PARM=ABEND
//SORTIN   DD DSN=DIRECCION.DE.FICHERO.ENTRADA,DISP=SHR
//SORTOUT1 DD DSN=DIRECCION.DE.FICHERO.SALIDA1,
//            DISP=(,CATLG,DELETE),SPACE=(TRK,(50,10),RLSE)
//SORTOUT2 DD DSN=DIRECCION.DE.FICHERO.SALIDA2,
//            DISP=(,CATLG,DELETE),SPACE=(TRK,(50,10),RLSE)
//FICHERR  DD DSN=DIRECCION.DE.FICHEROSALIDA.ERR,
//             DISP=(,CATLG,DELETE),SPACE=(TRK,(50,10),RLSE)
//SYSIN    DD *
  SORT FIELDS=COPY
  OUTFIL  INCLUDE=(5,3,CH,EQ,C'C01'),FNAMES=SORTOUT1
  OUTFIL  INCLUDE=(5,3,CH,EQ,C'C02'),FNAMES=SORTOUT2
  OUTFIL  INCLUDE=(5,3,CH,NE,C'C01',AND,5,3,CH,NE,C'C02'),
          FNAMES=SORTOUT1    
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=* 