//JSORT07      JOB (),' ',CLASS=A,MSGCLASS=Q,MSGLEVEL=(1,1),
//        REGION=0M,NOTIFY=&SYSUID RESTART STEP5
//***********************************************************
//*GENERAR UN FICHERO FIJO BLOQUEDAO
//*A PARTIR DE UN FICHERO VARIABLE BLOQUEADO
//**********************************************************
//STEP1   EXEC PGM=SORT,PARM=ABEND
//SORTIN   DD DSN=DIRECCION.DE.FICHERO.ENTRADA,DISP=SHR
//SORTOUT DD DSN=DIRECCION.DE.FICHERO.SALIDA1,
//            DISP=(,CATLG),SPACE=(TRK,(50,10),RLSE),
//            DCB=(RECFM=FB,LRECL=60)
//FICHERR  DD DSN=DIRECCION.DE.FICHEROSALIDA.ERR,
//             DISP=(,CATLG),SPACE=(TRK,(50,10),RLSE)
//SYSIN    DD *
  SORT FIELDS=(1,3,CH,A,23,9,CH,A)
  SUM FIELDS=(49,6,PD)
  OUTREC FIELDS=(1,3,2X,23,9,2X,C'SUMA:',49,6,TD=ZD)  
//SYSOUT   DD SYSOUT=*
//SYSPRINT DD SYSOUT=* 